src/Documents/ДанныеДокументаМЭДО/ДанныеДокументаМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеДокументаМЭДО</name>
  <comment>Контейнер загруженного/отправленного по МЭДО документа. И дополнительная детализация для МЭДО</comment>
  <registerRecords>InformationRegister.СостоянияДокументовМЭДО</registerRecords>
  <attributes>
    <name>АрхивЭСД</name>
    <comment>Внутри ДвоичныеДанные</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияМЭДО</name>
    <type>
      <types>EnumRef.ВерсииФорматаМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйФайл</name>
    <comment>Главный документ из сообщения, остальные - приложения к нему</comment>
    <type>
      <types>DefinedType.ПрисоединенныйФайлМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовКОтправке</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>DefinedType.ГрифДоступаМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПредметМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <comment>Для входящего - из паспорта сообщения, для исходящего - GUID из ссылки на документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяАрхиваЭСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоСоставления</name>
    <type>
      <types>CatalogRef.МестаСоставленияДокументовМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ОтветственныйМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееСостояние</name>
    <comment>Для отбора в списке</comment>
    <type>
      <types>EnumRef.СостоянияДокументовМЭДО</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/УровниСобытийМЭДО/УровниСобытийМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УровниСобытийМЭДО</name>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Информация</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ДанныеДокументаМЭДО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить все данные для МЭДО по документу. Или часть данных, если указано в параметре "Поля".
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО - Документ
//  Поля - Строка - Поля документа, через запятую, которые нужно получить, можно указать * - т.е. все, включая Ссылка.
//  				Можно получать поля через точку, т.е. передавать Поля, как часть запроса для ВЫБРАТЬ.
//  ДанныеОтвета - см. МЭДОСтруктурыДанных.НовыйОтвет.
// 
// Возвращаемое значение:
//  Структура - Поля зависят переданного параметра Поля 
Функция ПолучитьДанныеДокументаМЭДО(Документ, Поля, ДанныеОтвета) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		МЭДО.ЗаписьВЖурналСобытий(
			Перечисления.УровниСобытийМЭДО.Ошибка, 
			НСтр("ru = 'Пустой документ'"),
			НСтр("ru = 'Не указан документ'"),
			НСтр("ru = 'Для получения данных МЭДО по документу не указан сам документ'"),
			ДанныеОтвета);
		Возврат Новый Структура();
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	Документ.ДанныеДокументаМЭДО КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Документ = &Документ");
	Если Поля <> "*" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "*", Поля);
	КонецЕсли;
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Возврат МЭДОСтруктурыДанных.РезультатЗапросаВСтруктуру(Запрос.Выполнить());
	
КонецФункции

// Обертка - Получить объект данных документа, если он есть, если нет, то создается новый.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО - Документ
//  ДанныеОтвета - см. МЭДОСтруктурыДанных.НовыйОтвет.
// 
// Возвращаемое значение:
//  ДокументОбъект.ДанныеДокументаМЭДО
Функция ПолучитьОбъектДанныхДокумента(Документ, ДанныеОтвета) Экспорт
	
	ДанныеДокументаВИБ = ПолучитьДанныеДокументаМЭДО(Документ, "Ссылка", ДанныеОтвета);
	Если Не ДанныеОтвета.Успех Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДокументаВИБ.Ссылка) Тогда
		Возврат ДанныеДокументаВИБ.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ДанныеОбъект = СоздатьДокумент();
	ДанныеОбъект.Документ = Документ;
	
	Возврат ДанныеОбъект;
	
КонецФункции

// Записать объект данных документа, в случае ошибке в ДанныеОтвета выдать подробное описание и записать в лог.
// На вход из ДанныеОтвета может придти файл контейнера, который будет тогда тоже записан.
// 
// Параметры:
//  ДанныеОбъект - ДокументОбъект.ДанныеДокументаМЭДО
//  ДанныеОтвета - см. МЭДОСтруктурыДанных.НовыйОтвет.
// 
Процедура ЗаписатьОбъектДанныхДокумента(ДанныеОбъект, ДанныеОтвета) Экспорт
	
	Если ДанныеОтвета.Свойство("Файл") И ЗначениеЗаполнено(ДанныеОтвета.Файл.ЛокальноеИмя) 
		И ТипЗнч(ДанныеОтвета.Файл.ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
		ДанныеОбъект.АрхивЭСД = Новый ХранилищеЗначения(ДанныеОтвета.Файл.ДвоичныеДанные);
		ДанныеОбъект.ИмяАрхиваЭСД = ДанныеОтвета.Файл.ЛокальноеИмя;
	КонецЕсли;
	
	Если ДанныеОбъект.Модифицированность() Или ДанныеОбъект.ЭтоНовый() Тогда
		Попытка
			ДанныеОбъект.Записать();
		Исключение
			МЭДО.ЗаписьВЖурналСобытий(
				Перечисления.УровниСобытийМЭДО.Ошибка,
				ДанныеОбъект.Документ,
				Текст_ОшибкаЗаписиДанныхДокумента(),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
				ДанныеОтвета);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Текст_ОшибкаЗаписиДанныхДокумента()
	Возврат НСтр("ru = 'Ошибка записи ""Данных документа МЭДО""'");
КонецФункции

#КонецОбласти

#КонецЕсли
